:PROPERTIES:
:ID:       189e850b-66f2-4a05-a1a6-1b9ed6a66ee7
:END:
#+title: 测试
#+filetags: cpp

* 测试
** 正确性
*** 断言
- 断言 :: 代码的内部检查（程序员视角：这里绝对不可能XXX），是 *条件检查-打印错误信息-终止程序* 的快捷方式。断言分为：
  1. [[id:3adea9f8-12ce-4602-8478-949bd2006ee6][编译时断言]]（ *最佳实践* ）
  2. [[id:7e514cf1-8b7d-4b93-99ef-f0043a51857e][运行时断言]]


**** 编译时断言
:PROPERTIES:
:ID:       3adea9f8-12ce-4602-8478-949bd2006ee6
:END:
- 编译时断言 :: =static_assert关键字= （编译时求值，条件必须为[[id:127cefde-76f3-437b-ba9c-72ed8e928498][常量表达式]]）
#+begin_src cpp :results output :namespaces std :includes <iostream>
static_assert(sizeof(long) == 8, "long must be 8 bytes");
static_assert(sizeof(int) >= 4, "int must be at least 4 bytes");

int main() {
    return 0;
}
#+end_src


**** 运行时断言
:PROPERTIES:
:ID:       7e514cf1-8b7d-4b93-99ef-f0043a51857e
:END:
- 运行时断言 :: =assert宏= ，可以使用 =NDEBUG宏= 关闭/开启断言，打印消息的小技巧 =&&=
#+begin_src cpp :results output :namespaces std :includes <iostream>
#define NDEBUG // 关闭断言
// #undef NDEBUG  开启断言
#include <cassert>
int main() {
    assert(false && "必须为true！"); // 在这个翻译单元中断言被关闭，因此不会触发
    std::cout << "Hello, world!\n";
}
#+end_src

#+RESULTS:
: Hello, world!


*** 测试策略
- 测试策略 :: 代码的外部检查（用户视角），分为：
  1. [[id:1c5c4d7d-37eb-4486-a51d-2a5f43e81188][单元测试]]
  2. [[id:223e22ae-7924-4d35-a65f-3dd750273950][集成测试]]


**** 单元测试
:PROPERTIES:
:ID:       1c5c4d7d-37eb-4486-a51d-2a5f43e81188
:END:
- 单元测试 :: 对软件最小的可独立测试单元（eg：函数、类的成员方法）进行测试。分为： [fn:1]
  + 非正式测试     :: 函数调用处写测试代码，直接测试（适合单次测试，不适合多次测试）
  + 保留测试函数   :: 函数封装测试代码（适合多次测试，每次需要 人工比对 预期答案）
  + 自动化测试函数 :: 包含 测试代码、预期答案
  + 单元测试框架   :: 预先封装好的工具集，提供 测试用例组织、测试执行、结果统计


**** 集成测试
:PROPERTIES:
:ID:       223e22ae-7924-4d35-a65f-3dd750273950
:END:
- 集成测试 :: 所有单元都测试后，集成到程序中测试


** 性能
测试运行时间 =std::chrono=


** 测试完整性
*** 代码覆盖率
:PROPERTIES:
:ID:       9901f49a-d325-4b74-a34b-e75485830c57
:END:
- 代码覆盖率 :: 用于验证 代码测试的完整性。分为：
  + 语句覆盖率   :: 测试覆盖到的语句
#+begin_src cpp
int foo(int x, int y) {     // 测试 foo(1, 0) foo(0, 1)
    int z{y};
    if (x > y) z = x;       // 需测试 x > y 和 x <= y 两种情况
    return z;
}
#+end_src
  + 分支覆盖率   :: 测试覆盖到的分支（eg：if、switch）
#+begin_src cpp
void compare(int x, int y) {         // 测试 compare(1,0)、compare(0,1)、compare(0,0)
    if (x > y) cout << "Greater";    // 分支1
    else if (x < y) cout << "Less";  // 分支2
    else cout << "Equal";            // 分支3
}
#+end_src
  + 循环覆盖率   :: 测试覆盖到的不同迭代次数
#+begin_src cpp
void spam(int times) {
    for (int i=0; i<times; ++i) cout << "Spam! ";     // 测试 spam(1) spam(2) spam(3)
}
#+end_src
  + 不同输入类别 :: eg：整数、浮点、字符串、指针等


* Footnotes

[fn:1]
#+name: 非正式测试
#+begin_src cpp :results output :namespaces std :includes <iostream>
bool isLowerVowel(char c) {
    switch (c)
    {
    case 'a':
    case 'e':
    case 'i':
    case 'o':
    case 'u':
        return true;
    default:
        return false;
    }
}

int main() {
    // 非正式测试
    std::cout << isLowerVowel('a') << '\n'; // temporary test code, should produce 1
    std::cout << isLowerVowel('q') << '\n'; // temporary test code, should produce 0
}
#+end_src

#+RESULTS: 非正式测试
: 1
: 0

#+name: 保留测试函数
#+begin_src cpp :results output :namespaces std :includes <iostream>
bool isLowerVowel(char c) {
    switch (c)
    {
    case 'a':
    case 'e':
    case 'i':
    case 'o':
    case 'u':
        return true;
    default:
        return false;
    }
}

// NOTE 测试函数：可复用，用于后续测试
void testVowel() {
    std::cout << isLowerVowel('a') << '\n'; // temporary test code, should produce 1
    std::cout << isLowerVowel('q') << '\n'; // temporary test code, should produce 0
}

int main() {
    return 0;
}
#+end_src

#+name: 自动化测试函数
#+begin_src cpp :results output :namespaces std :includes <iostream>
bool isLowerVowel(char c) {
    switch (c)
    {
    case 'a':
    case 'e':
    case 'i':
    case 'o':
    case 'u':
        return true;
    default:
        return false;
    }
}

// returns the number of the test that failed, or 0 if all tests passed
int testVowel() {
    if (!isLowerVowel('a')) return 1;
    if (isLowerVowel('q')) return 2;

    return 0;
}

int main() {
    int result { testVowel() };
    if (result != 0)
        std::cout << "testVowel() test " << result << " failed.\n";
    else
        std::cout << "testVowel() tests passed.\n";
}
#+end_src

#+RESULTS: 自动化测试函数
: testVowel() tests passed.
